app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-02-25 12:48:22.713531"], ["updated_at", "2019-02-25 12:48:22.713531"]]