app/controllers/students_controller.rb

  def update
    get_student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Rick"], ["last_name", "Sanchez"], ["updated_at", "2019-02-25 12:23:57.866494"], ["id", 1]]